export const validation = {
  required: "Це поле обов'язкове",
  email: {
    invalid: "Недійсна електронна адреса",
    required: "Електронна адреса обов'язкова"
  },
  password: {
    minLength: "Мінімальна довжина пароля {{count}} символів",
    required: "Пароль обов'язковий",
    mismatch: "Паролі не збігаються",
    weak: "Пароль занадто слабкий",
    containsNumber: "Пароль має містити цифру",
    containsSpecial: "Пароль має містити спеціальний символ"
  },
  phone: {
    invalid: "Недійсний номер телефону",
    required: "Номер телефону обов'язковий"
  },
  name: {
    minLength: "Ім'я має містити мінімум {{count}} символів",
    maxLength: "Ім'я має містити максимум {{count}} символів",
    required: "Ім'я обов'язкове"
  },
  general: {
    minLength: "Мінімальна довжина {{count}} символів",
    maxLength: "Максимальна довжина {{count}} символів",
    numeric: "Поле має містити лише цифри",
    alpha: "Поле має містити лише літери",
    alphanumeric: "Поле має містити лише літери та цифри"
  }
};